{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 33, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [9, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["input_1", 0, 0, {}], ["conv2d", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 33, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 33, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [-1, 1089]}, "name": "reshape", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [-1, 1089]}, "name": "reshape_1", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "GRU", "config": {"name": "gru", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 33, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 19}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 20}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 21}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}, "name": "gru", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "GRU", "config": {"name": "gru_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 33, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 24}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 25}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 26}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": true}, "name": "gru_1", "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.expand_dims", "trainable": true, "dtype": "float32", "function": "expand_dims"}, "name": "tf.expand_dims", "inbound_nodes": [["gru", 0, 0, {"axis": 3}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.expand_dims_1", "trainable": true, "dtype": "float32", "function": "expand_dims"}, "name": "tf.expand_dims_1", "inbound_nodes": [["gru_1", 0, 0, {"axis": 3}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.leaky_relu", "trainable": true, "dtype": "float32", "function": "nn.leaky_relu"}, "name": "tf.nn.leaky_relu", "inbound_nodes": [["tf.expand_dims", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.leaky_relu_1", "trainable": true, "dtype": "float32", "function": "nn.leaky_relu"}, "name": "tf.nn.leaky_relu_1", "inbound_nodes": [["tf.expand_dims_1", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add", "inbound_nodes": [["tf.nn.leaky_relu", 0, 0, {"y": [[1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0], [1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, -1000000000.0], [1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0]], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_1", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_1", "inbound_nodes": [["tf.nn.leaky_relu_1", 0, 0, {"y": [[1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0], [1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0], [1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, 1.0, -1000000000.0], [-1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0, 1.0, 1.0, -1000000000.0], [1.0, 1.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, -1000000000.0, 1.0]], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.softmax", "trainable": true, "dtype": "float32", "function": "nn.softmax"}, "name": "tf.nn.softmax", "inbound_nodes": [["tf.__operators__.add", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.softmax_1", "trainable": true, "dtype": "float32", "function": "nn.softmax"}, "name": "tf.nn.softmax_1", "inbound_nodes": [["tf.__operators__.add_1", 0, 0, {}]]}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcxYAAAB0AKABZAF8AGQCGQB8AGQDGQChA1MAKQROeg9udHZ3\nLG50d2MtPm50dmPpAAAAAOkBAAAAKQLaAnRm2gZlaW5zdW0pAdoBeKkAcgYAAAD6RkM6L1VzZXJz\nL3l0a29mZmkvRGVza3RvcC9za2V0b24vU1RHQ05HUlVfQklMU1RNL0dDTi9zdGdjbmdydV9iaWxz\ndG0ucHnaCDxsYW1iZGE+wwAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "GCN.stgcngru_bilstm", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["tf.nn.softmax", 0, 0, {}], ["conv2d_2", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcxYAAAB0AKABZAF8AGQCGQB8AGQDGQChA1MAKQROeg9udHZ3\nLG50d2MtPm50dmPpAAAAAOkBAAAAKQLaAnRm2gZlaW5zdW0pAdoBeKkAcgYAAAD6RkM6L1VzZXJz\nL3l0a29mZmkvRGVza3RvcC9za2V0b24vU1RHQ05HUlVfQklMU1RNL0dDTi9zdGdjbmdydV9iaWxz\ndG0ucHnaCDxsYW1iZGE+zQAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "GCN.stgcngru_bilstm", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_1", "inbound_nodes": [[["tf.nn.softmax_1", 0, 0, {}], ["conv2d_4", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["lambda", 0, 0, {}], ["lambda_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [9, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [15, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [20, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_7", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_2", "inbound_nodes": [[["dropout", 0, 0, {}], ["dropout_1", 0, 0, {}], ["dropout_2", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "dtype": "float32", "target_shape": [-1, 1584]}, "name": "reshape_2", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 80, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 54}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 55}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 56}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional", "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_3", "inbound_nodes": [[["bidirectional", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 40, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 61}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 62}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 63}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_1", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_4", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_2", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 40, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 68}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 69}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 70}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_2", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_5", "inbound_nodes": [[["bidirectional_2", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_3", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 80, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 75}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 76}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 77}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional_3", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_6", "inbound_nodes": [[["bidirectional_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0]]}, "keras_version": "2.11.0", "backend": "tensorflow"}